InformationRegisters/ПланВходящихКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланВходящихКонтактов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПраваПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидВходящегоКонтактаСофтФон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеСофтФона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬ_ПоказыватьНомераТелефоновВМобильномКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬ_ЗвонокСМобильногоКлиентаКонтрагентуНапрямую</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬ_ЗвонокСМобильногоКлиентаКонтрагентуЧерезАстериск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеВидовЦенЦенамУслугРаскроя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеВидовЦенЦенамУслугРаскроя</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦеныУслугРаскроя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеныУслугРаскроя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкиЦенНаУслугиПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеркампани</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>#9777</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЖурналПравокЗаднимЧислом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналПравокЗаднимЧислом</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтараяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоваяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСтатусПроведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатусПроведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСтатусПометкиНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатусПометкиНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Лен_ЖурналИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Лен_ЖурналИзменений</Name>
			<Comment>Хранение информации об изменениях значений реквизитов объектов ИБ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУстановкиЦенНаУслугиПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУстановкиЦенНаУслугиПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВидуЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИнтеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВнутреннихЗаказов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПодпискиНаСобытия/Ext/Module.bsl
// GetUSBKeyComponentLocationV3
//
//Возвращаемое значение:
//	Строка, расположение компоненты защиты для текущего используемого типа платформы
//
Функция GetUSBKeyComponentLocationV3() 
    Перем Постфикс;
    СистемнаяИнформация = Новый СистемнаяИнформация;
    
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 тогда
		Макет = Метаданные.ОбщиеМакеты.КомпонентаЗащитыV3_Hasp_Win32;
    ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 тогда
        Макет = Метаданные.ОбщиеМакеты.КомпонентаЗащитыV3_Hasp_Win64;
    КонецЕсли;
    
    Возврат Макет.ПолноеИмя();
	
КонецФункции


Процедура ЗаказДоговорОтменаПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Перем а;
	Перем б;
	а=1;
	б=2;
	в = а+ б;
	
	Если НЕ Источник.Основание = Неопределено Тогда
		//Если ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.Замер") Тогда
		//	Если НЕ Источник.Основание.Пустая() Тогда
		//		Попытка
		//			ЗаключениеДоговора = РегистрыСведений.ЗаключениеЗаказаДоговора.СоздатьНаборЗаписей();
		//			ЗаключениеДоговора.Отбор.Замер.Установить(Источник.Основание);
		//			ЗаключениеДоговора.Прочитать();
		//			ЗаключениеДоговора.Удалить(0);
		//			ЗаключениеДоговора.Записать();
		//		Исключение
		//			Отказ = Истина;
		//			Возврат;
		//		КонецПопытки;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

Процедура ПоступлениеТоваровОтменаПроведенияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//Если НЕ Источник.Основание = Неопределено Тогда
	//	Если НЕ Источник.Основание.Пустая() Тогда
	//		РегистрыНакопления.ЗаказыПоставщикам.ОбновитьСостояниеЗаказаПоставщику(Источник.Основание, Источник);
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Процедура ПланированиеВходящихКонтактовОтменаПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Перем а;
	Перем б;
	а=1;
	б=2;
	в = а+ б;
	
	Попытка
		Для Каждого СтрокаПлан Из Источник.План Цикл
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 1);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 2);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 3);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 4);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 5);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 6);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 7);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 8);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 9);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 10);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 11);
			РегистрыСведений.ПланВходящихКонтактов.УдалитьДанныеИзПланаВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Источник.Год, 12);
		КонецЦикла;
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;

	
	
КонецПроцедуры

Процедура ПользователиУстановкаПометкиУдаленияПриЗаписи(Источник, Отказ) Экспорт
	
	Попытка
		Если Источник.ПометкаУдаления Тогда
			НаборЗаписей = РегистрыСведений.ПраваПользователей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Пользователь.Установить(Источник.Ссылка);
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьСоответствиеВидовЦенНенамУслугРаскроя(Источник, Отказ) Экспорт
	
	ИзмерениеВидЦенНастройкаИнтеркампани = Неопределено;
	Если Источник.ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоВидуЦен Тогда
		ИзмерениеВидЦенНастройкаИнтеркампани = Источник.ВидЦен;
	ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийУстановкиЦенНаУслугиПроизводства.ПоИнтеркампани Тогда
		ИзмерениеВидЦенНастройкаИнтеркампани = Источник.НастройкаИнтеркампани;	
	КонецЕсли;
	
	//Предварительно очистим все записи по ссылке
	НаборЗаписей = РегистрыСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Период.Установить(Источник.Дата);  // могли изменить дату
	НаборЗаписей.Прочитать();
	
	КоличествоЗаписей = НаборЗаписей.Количество();
	Для Сч = 1 По КоличествоЗаписей Цикл
		Если НаборЗаписей[КоличествоЗаписей-Сч].ЦеныУслугРаскроя = Источник.Ссылка Тогда
			НаборЗаписей.Удалить(КоличествоЗаписей-Сч);
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	Если НЕ Источник.ПометкаУдаления Тогда		
		//Теперь сделаем новую запись
		НоваяЗапись = РегистрыСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.Период = Источник.Дата;
		НоваяЗапись.Валюта = Источник.Валюта;
		НоваяЗапись.ВидНоменклатуры = Источник.ВидНоменклатуры;
		НоваяЗапись.ВидОперации = Источник.ВидОперации;
		НоваяЗапись.ВидЦен = ИзмерениеВидЦенНастройкаИнтеркампани;
		НоваяЗапись.ЦеныУслугРаскроя = Источник.Ссылка;
		
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменаПроведенияЗаказа(Источник, Отказ) Экспорт
	
	//проверим сколько отгружено по заказу. Если отгружено больше чем заказано в заказе - отказываем в проведении (защита от удаления товаров из заказа после его отгрузки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОбороты.Номенклатура,
	|	ЗаказыПокупателейОбороты.КоличествоРасход КАК Отгружено
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(, , , ЗаказНаПроизводство = &ЗаказНаПроизводство) КАК ЗаказыПокупателейОбороты";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("По данному заказу уже отгружено " + Выборка.Отгружено + " ед. номенклатуры """ + Выборка.Номенклатура + """");
		Отказ = Истина;
	КонецЦикла;
	Если Отказ Тогда
		Сообщить("Отмена проведения не выполнена");
	КонецЕсли;
	
КонецПроцедуры

// чтобы не трогать модуль объекта БСП
Процедура ПередЗаписьюПользователиПередЗаписью(Источник, Отказ) Экспорт
	
	Если (Источник.ПометкаУдаления И НЕ Источник.Ссылка.ПометкаУдаления)
		ИЛИ (НЕ Источник.ПометкаУдаления И Источник.Ссылка.ПометкаУдаления) Тогда
		
		Если (Источник.Наименование = "Администратор"
			ИЛИ Источник.Наименование = "Служба поддержки SmartCeilings"
			//ИЛИ Источник.Наименование = "УстановкаОбновлений" // #7604 закомментировано
			)
			//И НЕ Строка(ПараметрыСеанса.ТекущийПользователь) = "Администратор"
			И НЕ Строка(Пользователи.ТекущийПользователь()) = "Служба поддержки SmartCeilings" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нарушение прав доступа");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюЖурналПравокЗаднимЧисломПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Источник) Тогда
		Источник = Источник.ПолучитьОбъект();
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
		
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка
	   И Источник.ДополнительныеСвойства.Свойство("ПропуститьЗаписьВЖурналПравокЗаднимЧислом")
	   Тогда
		Возврат;
	КонецЕсли;
	
	Если СтандартныеПодсистемыСервер.ЭтоИдентификаторОбъектаМетаданных(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗаписыватьДокументВЖурналПравокЗаднимЧислом(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	
	НачальноеСостояниеПроведен = Источник.Ссылка.Проведен;
	КонечноеСостояниеПроведен  = ?(РежимЗаписи = РежимЗаписиДокумента.Проведение, Истина, Ложь); 
	
	НачальноеСостояниеПометкаУдаления = Источник.Ссылка.ПометкаУдаления;
	КонечноеСостояниеПометкаУдаления  = Источник.ПометкаУдаления;
	
	НачальнаяСумма = 0 ;
	КонечнаяСумма  = 0;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаДокумента", Источник.Метаданные()) тогда
		НачальнаяСумма = Источник.Ссылка.СуммаДокумента;
		КонечнаяСумма  = Источник.СуммаДокумента; 		
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Сумма", Источник.Метаданные()) Тогда
		НачальнаяСумма = Источник.Ссылка.Сумма;
		КонечнаяСумма  = Источник.Сумма;		
	КонецЕсли;
	
	Если НачальноеСостояниеПроведен <> КонечноеСостояниеПроведен
		ИЛИ НачальноеСостояниеПометкаУдаления <> КонечноеСостояниеПометкаУдаления
		ИЛИ НачальнаяСумма <> КонечнаяСумма Тогда
		МенеджерЗаписи = РегистрыСведений.ЖурналПравокЗаднимЧислом.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.Документ = Источник.Ссылка;
		МенеджерЗаписи.СтараяСумма = НачальнаяСумма;
		МенеджерЗаписи.НоваяСумма  = КонечнаяСумма;
		МенеджерЗаписи.СтарыйСтатусПроведен = НачальноеСостояниеПроведен;
		МенеджерЗаписи.НовыйСтатусПроведен  = КонечноеСостояниеПроведен;
		МенеджерЗаписи.СтарыйСтатусПометкиНаУдаление = НачальноеСостояниеПометкаУдаления;
		МенеджерЗаписи.НовыйСтатусПометкиНаУдаление  = КонечноеСостояниеПометкаУдаления;		
		МенеджерЗаписи.ТребуетсяОтправкаУведомления = ПолучитьФункциональнуюОпцию("ОтправлятьEmailПоКонтролюПравокЗаднимЧислом");		
		МенеджерЗаписи.Записать();
		
		// реализовано через регламентное задание
		//Если ПолучитьФункциональнуюОпцию("ОтправлятьEmailПоКонтролюПравокЗаднимЧислом") Тогда
		//	ШаблонТекста = ПолучитьФункциональнуюОпцию("ШаблонТекстаEmailПоПравкеЗаднимЧислом");
		//	Если НЕ ПустаяСтрока(ШаблонТекста) Тогда
		//		УчетнаяЗапись = ПолучитьФункциональнуюОпцию("УчетнаяЗаписьЭлектроннойПочтыДляАвтоматическихРассылок");
		//		ТекстПисьма  = ПолучитьФункциональнуюОпцию("ШаблонТекстаEmailПоПравкеЗаднимЧислом");
		//		Если НЕ ПустаяСтрока(ТекстПисьма) И ЗначениеЗаполнено(УчетнаяЗапись) Тогда 
		//			ПараметрыШаблона = Новый Структура("Документ, Пользователь, Период, СтараяСумма, НоваяСумма, СтарыйСтатусПроведен, НовыйСтатусПроведен, СтарыйСтатусПометкиНаУдаление, НовыйСтатусПометкиНаУдаление");
		//			Для каждого Параметр из ПараметрыШаблона Цикл
		//				ТекстПисьма = СтрЗаменить(ТекстПисьма, "%" + Строка(Параметр.Ключ), МенеджерЗаписи[Параметр.Ключ]);	
		//			КонецЦикла;
		//			СписокEmailСтрокой = ПолучитьФункциональнуюОпцию("СписокEmailПоКонтролюПравокЗаднимЧислом");
		//			МассивПолучателей  = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокEmailСтрокой, ";", Истина, Истина);
		//			Для каждого ПочтаПолучателя из МассивПолучателей Цикл
		//				
		//				ПисьмоСсылка = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо("Правка задним числом", , ТекстПисьма, , ПочтаПолучателя, , УчетнаяЗапись);
		//				Если ЗначениеЗаполнено(ПисьмоСсылка) Тогда
		//					СтатусОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(ПисьмоСсылка);	
		//				КонецЕсли;
		//			КонецЦикла;
		//		КонецЕсли;
		//	КонецЕсли;			
		//КонецЕсли;

	КонецЕсли;

КонецПроцедуры
	
// Проверяет настройки контроля документа по журналу правок задним числом
//
Функция ЗаписыватьДокументВЖурналПравокЗаднимЧислом(Знач Источник)
	
	// Проверяем, что подсистема включена
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиЖурналПравокЗаднимЧислом") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Источник.Метаданные());
	КонтролироватьДокумент = ПолучитьФункциональнуюОпцию("ЗаписыватьОбъектВЖурналПравокЗаднимЧислом", Новый Структура("ТипДокументаЖурналаПравок", ТипДокумента));
	
	Если КонтролироватьДокумент Тогда
		РазницаВДнях = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(Источник.Дата)) / (60 * 60 * 24);
		//Если РазницаВДнях = 0 ИЛИ РазницаВДнях > ПолучитьФункциональнуюОпцию("КоличествоДнейКонтроляПравокЗаднимЧислом") Тогда
		Если РазницаВДнях <= ПолучитьФункциональнуюОпцию("КоличествоДнейКонтроляПравокЗаднимЧислом") Тогда
			КонтролироватьДокумент = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонтролироватьДокумент;
	
КонецФункции

Процедура ПередЗаписьюДокументПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//#9528	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияПроведенныхДокументовДругихПользователей,
	                                                                |ДополнительныеПраваЗапретРедактированияПроведенныхДокументовПоТипам,
																	|ДополнительныеПраваЗапретПометкиНаУдалениеДокументовПоТипам", ТекущийПользователь);
	
	Если ТекущийПользователь.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовДругихПользователей 
		И Источник.Проведен 		
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Автор", Источник.Метаданные()) Тогда
		Если НЕ Источник.Автор = ТекущийПользователь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено редактирование проведенных документов других пользователей", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	//#11190
	Если ЗначениеЗаполнено(Источник.Ссылка) 
		И Источник.Ссылка.Проведен 
		И РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовПоТипам
		Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("ТипДокумента", Источник.Метаданные().Имя);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	Справочник.Пользователи.ЗапрещенныеПослеПроведенияДокументы КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &ТекущийПользователь
		|	И ДанныеСправочника.Ссылка.ДополнительныеПраваЗапретРедактированияПроведенныхДокументовПоТипам
		|	И ДанныеСправочника.ТипДокумента = &ТипДокумента";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройками пользователя запрещено редактирование проведенных документов!", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	//#15997
	Если ЗначениеЗаполнено(Источник.Ссылка) 
		И НЕ Источник.Ссылка.ПометкаУдаления = Источник.ПометкаУдаления
		И РеквизитыПользователя.ДополнительныеПраваЗапретПометкиНаУдалениеДокументовПоТипам
		Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("ТипДокумента", Источник.Метаданные().Имя);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	Справочник.Пользователи.ЗапрещенныеКПометкеУдаленияТипыДокументов КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &ТекущийПользователь
		|	И ДанныеСправочника.ТипДокумента = &ТипДокумента";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройками пользователя запрещено изменение пометки удаления документов данного типа!", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаЗаполненияОбъектовСКонтролемРеквизитовОбработчик(Источник) Экспорт
	//(не используется) 
	// не удалять без удаления подписки	
КонецПроцедуры

//nva+++
Процедура nva_ПередПроведениемДокСписанияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Ссылка) И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		Если НЕ ЗначениеЗаполнено(Источник.Комментарий) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Комментарий"" обязательно должно быть заполненно!", , , , Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Источник.Ссылка) И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если НЕ ЗначениеЗаполнено(Источник.СрокПоставки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Срок  поставки"" обязательно должно быть заполненно!", , , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.СрокОплаты) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Срок  оплаты"" обязательно должно быть заполненно!", , , , Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Источник.Ссылка) И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ОжидаемаяДатаОтгрузки") Тогда
			Если НЕ ЗначениеЗаполнено(Источник.ОжидаемаяДатаОтгрузки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Дата огрузки с"" обязательно должно быть заполненно!", , , , Отказ);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Основание") Тогда
			Если ЗначениеЗаполнено(Источник.Основание) И ТипЗнч(Источник.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") 
				И Источник.Основание.ТекущийСтатус = Справочники.СтатусыЗаказовПоставщику.Отменен Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение документов на основании ""Заказа поставщику"" со статусом ""Отменен"" запрещено", , , , Отказ);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура дкПередЗаписью(Источник, Отказ, РежимЗаписи=ложь, РежимПроведения=ложь) Экспорт
	
	Если Не Отказ Тогда
						
		дкНабор = РегистрыСведений.Лен_ЖурналИзменений.СоздатьНаборЗаписей();
		дкНабор.ЗаписатьВЖурналИзменений(Источник);
		
	КонецЕсли;
	
КонецПроцедуры
//nva---
